In [2]:
import numpy as np
from __future__ import division

from pandas import Series, DataFrame
import pandas as pd

from numpy.random import randn

In [3]:
a=[3,2,1]

In [4]:
a.sort()

In [5]:
a

[1, 2, 3]

In [6]:
import numpy as np

In [7]:
arr = np.arange(5,50,5).reshape(3,3)
arr

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [8]:
arr = np.arange(50).reshape(10, 5)
arr

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34],
       [35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44],
       [45, 46, 47, 48, 49]])

In [9]:
np.dot(arr2d.T, arr2d)

NameError: name 'arr2d' is not defined

In [ ]:
arr[:2, 1:]

In [ ]:
arr[1:, :2]

In [ ]:
arr = np.arange(0, 11)

In [ ]:
arr

In [ ]:
arr = np.array([[1, 2, 3, 4], [5, 6, 7, 8]])

In [ ]:
arr

In [ ]:
np.arange(2,10,2)

In [ ]:
arr2d = np.arange(50).reshape(10,5)

In [ ]:
arr2d

In [ ]:
arr2d.T

In [ ]:
my_list2 = [5,6,7,8]
my_2list = [my_list1, my_list2]
my_arr = np.array(my_2list)

In [ ]:
my_arr.shape[1]

In [ ]:
arr2d = np.zeros([10,10])

In [ ]:
arr2d

In [ ]:
nRows = arr2d.shape[1]
nRows

In [ ]:
for i in range(nRows):
    arr2d[[i]] = i

In [ ]:
arr2d

In [ ]:
arr2d = np.arange(5,50,5).reshape(3,3)

In [ ]:
arr2d

In [ ]:
arr2d[1,0]

In [ ]:
arr2d[[1,2]]

In [10]:
nfl_frame = pd.read_clipboard()

In [11]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North

In [13]:
DataFrame(nfl_frame,columns=['Team','First NFL Season','GP','Stadium'])

                      Team  First NFL Season     GP  Stadium
0           Dallas Cowboys              1960    882      NaN
1        Green Bay Packers              1921  1,336      NaN
2            Chicago Bears              1920  1,370      NaN
3           Miami Dolphins              1966    800      NaN
4  New England Patriots[b]              1960    884      NaN
5        Minnesota Vikings              1961    870      NaN

In [14]:
nfl_frame['Team']

0             Dallas Cowboys
1          Green Bay Packers
2              Chicago Bears
3             Miami Dolphins
4    New England Patriots[b]
5          Minnesota Vikings
Name: Team, dtype: object

In [16]:
nfl_frame.iloc[3]

Rank                             4
Team                Miami Dolphins
GP                             800
Won                            445
Lost                           351
Tied                             4
Pct.                         0.559
First NFL Season              1966
Division                  AFC East
Name: 3, dtype: object

In [17]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North

In [18]:
nfl_frame['Stadium']="Levi's Stadium"

In [19]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East,Levi's Stadium
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North,Levi's Stadium
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North,Levi's Stadium
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East,Levi's Stadium
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East,Levi's Stadium
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North,Levi's Stadium

In [20]:
stadiums = Series(["Levi's Stadium","AT&T Stadium"],index=[4,0])
nfl_frame['Stadium']=stadiums

In [21]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East,AT&T Stadium
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North,NaN
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North,NaN
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East,NaN
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East,Levi's Stadium
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North,NaN

In [22]:
del nfl_frame['Stadium']

In [23]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North

In [24]:
data = {'City':['SF','LA','NYC'],
        'Population':[837000,3880000,8400000]}

In [25]:
data

{'City': ['SF', 'LA', 'NYC'], 'Population': [837000, 3880000, 8400000]}

In [26]:
city_frame = DataFrame(data)

In [27]:
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [30]:
dframe=DataFrame(randn(25).reshape((5,5)),
                                         index=['A','B','D','E','F'],
                                         columns=['col1','col2','col3','col4','col5'])

In [31]:
dframe

       col1      col2      col3      col4      col5
A -0.172570 -1.209701  0.621439  0.066410  0.313595
B -0.218846  1.366881  0.606136  1.198107 -1.926436
D -0.694195  0.161727 -0.895810 -0.566266  0.370896
E -0.789214  0.727774  0.287437  1.501391 -0.340299
F  1.171646  0.072541  1.038768  1.042775 -1.005326

In [32]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [35]:
dframe4 = dframe.ix[['A','B','C','D','E','F'],new_columns]

In [36]:
data={'http_status': [200,200,404,404,301],
      'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]}
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame(data, index=index)

In [37]:
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [38]:
new_index= ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10', 'Chrome']new_columns=['http_status', 'user_agent']
df2 = df.reindex(index=new_index, columns=new_columns)

In [39]:
df2

               http_status  user_agent
Safari               404.0         NaN
Iceweasel              NaN         NaN
Comodo Dragon          NaN         NaN
IE10                 404.0         NaN
Chrome               200.0         NaN

In [40]:
new_index= ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10', 'Chrome']new_columns=['http_status', 'user_agent']
df2 = df.reindex(index=new_index, columns=new_columns, fill_value='missing')

In [41]:
df2

              http_status user_agent
Safari                404    missing
Iceweasel         missing    missing
Comodo Dragon     missing    missing
IE10                  404    missing
Chrome                200    missing

In [42]:
ser4 = Series(['USA','Mexico','Canada'],index=[0,5,10])

In [44]:
ser5 = ser4.reindex(range(15),method='ffill')

ser5

In [45]:
ser5

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [46]:
nfl_frame[['Team','GP']]

                      Team     GP
0           Dallas Cowboys    882
1        Green Bay Packers  1,336
2            Chicago Bears  1,370
3           Miami Dolphins    800
4  New England Patriots[b]    884
5        Minnesota Vikings    870

In [57]:
nfl_frame[pd.to_numeric(nfl_frame['GP'].str.replace(',','')) > 1000]

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North

In [48]:
nfl_frame['GP']

0      882
1    1,336
2    1,370
3      800
4      884
5      870
Name: GP, dtype: object

In [51]:
nfl_frame['GP'].datatype='int32'

In [52]:
nfl_frame['GP']

0      882
1    1,336
2    1,370
3      800
4      884
5      870
Name: GP, dtype: object

In [12]:
dframe1 = DataFrame({'key':['X','Z','Y','Z','X','X'],'data_set_1': np.arange(6)})
dframe2 = DataFrame({'key':['Q','Y','Z', 'Z'],'data_set_2':[1,2,3,3]})

In [9]:
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [14]:
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z
3           3   Z

In [13]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   Z           3
1           1   Z           3
2           3   Z           3
3           3   Z           3
4           2   Y           2

In [15]:
pd.merge(dframe1,dframe2,on='key',how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z         3.0
2           1   Z         3.0
3           2   Y         2.0
4           3   Z         3.0
5           3   Z         3.0
6           4   X         NaN
7           5   X         NaN

In [16]:
pd.merge(dframe1,dframe2,on='key',how='right')

   data_set_1 key  data_set_2
0         1.0   Z           3
1         3.0   Z           3
2         1.0   Z           3
3         3.0   Z           3
4         2.0   Y           2
5         NaN   Q           1

In [17]:
pd.merge(dframe1,dframe2,on='key',how='outer')

   data_set_1 key  data_set_2
0         0.0   X         NaN
1         4.0   X         NaN
2         5.0   X         NaN
3         1.0   Z         3.0
4         1.0   Z         3.0
5         3.0   Z         3.0
6         3.0   Z         3.0
7         2.0   Y         2.0
8         NaN   Q         1.0

In [18]:
df_left = DataFrame({'key1': ['SF', 'SF', 'LA'],
                  'key2': ['one', 'two', 'one'],
                  'left_data': [10,20,30]})

df_right = DataFrame({'key1': ['SF', 'SF', 'LA', 'LA'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'right_data': [40,50,60,70]})

pd.merge(df_left, df_right, on=['key1', 'key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0        40.0
1   SF  one       10.0        50.0
2   SF  two       20.0         NaN
3   LA  one       30.0        60.0
4   LA  two        NaN        70.0

In [19]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [20]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [21]:
pd.merge(df_left,df_right,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    one          50
2   SF    two         20    one          40
3   SF    two         20    one          50
4   LA    one         30    one          60
5   LA    one         30    two          70

In [22]:
pd.merge(df_left,df_right, on='key1',suffixes=('_lefty','_righty'))

  key1 key2_lefty  left_data key2_righty  right_data
0   SF        one         10         one          40
1   SF        one         10         one          50
2   SF        two         20         one          40
3   SF        two         20         one          50
4   LA        one         30         one          60
5   LA        one         30         two          70